In [2]:
import numpy as np
import pandas as pd
from statsmodels.sandbox.regression.try_treewalker import data2
%matplotlib inline

[0, 1]
final branch with [0, 1] 1
[2, 3]
final branch with [2, 3] 5
[4, 5, 6]
final branch with [4, 5, 6] 15
working on branch [[2, 3], [4, 5, 6]] 40
[7]
final branch with [7] 7
working on branch [[0, 1], [[2, 3], [4, 5, 6]], [7]] 56
56

 tree with dictionary data
top 1000
subtree [('B1', ['a', 'b']), ('B2', [('B21', ['c', 'd']), ('B22', ['e', 'f', 'g'])]), ('B3', ['h'])]
B1 100
subtree ['a', 'b']
final branch with a a 0
final branch with b b 1
working on branch ('B1', ['a', 'b']) B1ab
B2 200
subtree [('B21', ['c', 'd']), ('B22', ['e', 'f', 'g'])]
B21 21
subtree ['c', 'd']
final branch with c c 2
final branch with d d 3
working on branch ('B21', ['c', 'd']) B21cd
B22 22
subtree ['e', 'f', 'g']
final branch with e e 4
final branch with f f 5
final branch with g g 6
working on branch ('B22', ['e', 'f', 'g']) B22efg
working on branch ('B2', [('B21', ['c', 'd']), ('B22', ['e', 'f', 'g'])]) B2B21cdB22efg
B3 300
subtree ['h']
final branch with h h 7
working on branch ('B3', ['h']) B3h
working on branch ('top', [('B1', ['a', 'b']), ('B2', [('B21', ['c', 'd']), ('B22', ['e', 'f', 'g'])]), ('B3', ['h'])]) topB1abB2B21cdB22efgB3h
topB1abB2B21cdB22efgB3h

In [3]:
df = pd.DataFrame({"key1" : ["a", "a", None, "b", "b", "a", None],
                "key2" : pd.Series([1, 2, 1, 2, 1, None, 1], dtype="Int64"), 
                "data1" : np.random.standard_normal(7),"data2" : np.random.standard_normal(7)})

In [4]:
df

   key1  key2     data1     data2
0     a     1 -0.573655  0.008590
1     a     2  0.402903  0.286663
2  None     1 -0.794832 -0.319291
3     b     2  0.505938 -1.031302
4     b     1  0.677217 -0.054212
5     a  <NA> -0.520308 -1.120090
6  None     1 -1.613930 -1.532617

In [5]:
grouped = df["data1"].groupby(df["key1"])

In [6]:
grouped

In [7]:
grouped.mean()

key1
a   -0.230353
b    0.591577
Name: data1, dtype: float64

In [8]:
means = df["data1"].groupby([df["key1"], df["key2"]]).mean()

In [9]:
means

key1  key2
a     1      -0.573655
      2       0.402903
b     1       0.677217
      2       0.505938
Name: data1, dtype: float64

In [10]:
states= np.array(["OH", "CA", "CA", "OH", "OH", "CA", "OH"])
years = np.array([2005, 2005, 2006, 2005, 2006, 2006, 2005])

In [11]:
df["data1"].groupby([states, years]).mean()

CA  2005    0.402903
    2006   -0.657570
OH  2005   -0.560549
    2006    0.677217
Name: data1, dtype: float64

In [12]:
df.groupby("key1").mean()

      key2     data1     data2
key1
a      1.5 -0.230353 -0.274946
b      1.5  0.591577 -0.542757

In [13]:
df.groupby("key2").mean(numeric_only=True)

         data1     data2
key2
1    -0.576300 -0.474383
2     0.454421 -0.372320

In [14]:
df.groupby(["key1", "key2"]).mean()

              data1     data2
key1 key2
a    1    -0.573655  0.008590
     2     0.402903  0.286663
b    1     0.677217 -0.054212
     2     0.505938 -1.031302

In [15]:
df.groupby(["key1", "key2"]).size()

key1  key2
a     1       1
      2       1
b     1       1
      2       1
dtype: int64

In [16]:
df.groupby("key1",dropna=False).size()

key1
a      3
b      2
NaN    2
dtype: int64

In [17]:
df.groupby(["key1", "key2"],dropna=False).size()

key1  key2
a     1       1
      2       1
      <NA>    1
b     1       1
      2       1
NaN   1       2
dtype: int64

In [18]:
df.groupby("key1").count()

      key2  data1  data2
key1
a        2      3      3
b        2      2      2

In [19]:
for name, group in df.groupby("key1"):
    print(name)
    print(group)

a
  key1  key2     data1     data2
0    a     1 -0.573655  0.008590
1    a     2  0.402903  0.286663
5    a  <NA> -0.520308 -1.120090
b
  key1  key2     data1     data2
3    b     2  0.505938 -1.031302
4    b     1  0.677217 -0.054212

In [20]:
for (k1, k2), group in df.groupby(["key1", "key2"]):
    print((k1, k2))
    print(group)

('a', 1)
  key1  key2     data1    data2
0    a     1 -0.573655  0.00859
('a', 2)
  key1  key2     data1     data2
1    a     2  0.402903  0.286663
('b', 1)
  key1  key2     data1     data2
4    b     1  0.677217 -0.054212
('b', 2)
  key1  key2     data1     data2
3    b     2  0.505938 -1.031302

In [21]:
pieces ={name: group for name, group in df.groupby("key1")}

In [22]:
pieces["b"]

  key1  key2     data1     data2
3    b     2  0.505938 -1.031302
4    b     1  0.677217 -0.054212

In [23]:
grouped = df.groupby({"key1": "key", "key2": "key",
                          "data1": "data", "data2": "data"}, axis="columns")

/var/folders/7p/3wrdkgn5323285b4npq3z6_c0000gp/T/ipykernel_5511/2987158108.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  grouped = df.groupby({"key1": "key", "key2": "key",

In [24]:
for group_key, group_value in grouped:
    print(group_key)
    print(group_value)

data
      data1     data2
0 -0.573655  0.008590
1  0.402903  0.286663
2 -0.794832 -0.319291
3  0.505938 -1.031302
4  0.677217 -0.054212
5 -0.520308 -1.120090
6 -1.613930 -1.532617
key
   key1  key2
0     a     1
1     a     2
2  None     1
3     b     2
4     b     1
5     a  <NA>
6  None     1

In [25]:
df.groupby(["key1", "key2"])[["data2"]].mean()

              data2
key1 key2
a    1     0.008590
     2     0.286663
b    1    -0.054212
     2    -1.031302

In [26]:
s_grouped = df.groupby(["key1", "key2"])["data2"]

In [27]:
s_grouped

In [28]:
s_grouped.mean()

key1  key2
a     1       0.008590
      2       0.286663
b     1      -0.054212
      2      -1.031302
Name: data2, dtype: float64

In [29]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=["a", "b", "c", "d", "e"],
                      index=["Joe", "Steve", "Wanda", "Jill", "Trey"])

In [30]:
people.iloc[2:3, [1, 2]] = np.nan

In [31]:
people

              a         b         c         d         e
Joe    1.052542  1.272659 -0.525425 -1.604775  0.020381
Steve -1.216545  0.893820  0.527838  0.539376  0.775155
Wanda -1.585707       NaN       NaN  0.536405  1.654745
Jill  -0.431317  1.062873  0.044582  1.012585  0.390281
Trey  -0.060340 -0.070291 -0.545727 -0.536098  0.638092

In [32]:
mapping = {"a": "red", "b": "red", "c": "blue",
           "d": "blue", "e": "red", "f": "orange"}

In [33]:
by_column = people.groupby(mapping, axis=1)

/var/folders/7p/3wrdkgn5323285b4npq3z6_c0000gp/T/ipykernel_5511/953159321.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  by_column = people.groupby(mapping, axis=1)

In [34]:
by_column.sum()

           blue       red
Joe   -2.130201  2.345582
Steve  1.067214  0.452429
Wanda  0.536405  0.069038
Jill   1.057167  1.021836
Trey  -1.081825  0.507461

In [35]:
map_series = pd.Series(mapping)

In [36]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [37]:
people.groupby(map_series, axis=1).count()

/var/folders/7p/3wrdkgn5323285b4npq3z6_c0000gp/T/ipykernel_5511/1366557749.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  people.groupby(map_series, axis=1).count()

       blue  red
Joe       2    3
Steve     2    3
Wanda     1    2
Jill      2    3
Trey      2    3

In [38]:
people.groupby(len).sum()

          a         b         c         d         e
3  1.052542  1.272659 -0.525425 -1.604775  0.020381
4 -0.491658  0.992582 -0.501145  0.476487  1.028373
5 -2.802252  0.893820  0.527838  1.075782  2.429900

In [39]:
key_list = ["one", "one", "one", "two", "two"]

In [40]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  1.052542  1.272659 -0.525425 -1.604775  0.020381
4 two -0.431317 -0.070291 -0.545727 -0.536098  0.390281
5 one -1.585707  0.893820  0.527838  0.536405  0.775155

In [41]:
columns = pd.MultiIndex.from_arrays([["US", "US", "US", "JP", "JP"],
                                     [1, 3, 5, 1, 3]],
                                     names=["cty", "tenor"])

In [42]:
hier_df = pd.DataFrame(np.random.standard_normal((4, 5)), columns=columns)

In [43]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.751562  0.399443  1.090096  0.533472 -1.351913
1      1.631355  1.312680 -1.082308 -1.141276 -0.725024
2     -1.183165 -0.631559  1.108591 -1.075179 -1.275462
3     -0.945347  0.549344 -0.635297 -1.526650  1.994061

In [44]:
hier_df.groupby(level="cty", axis=1).count()

/var/folders/7p/3wrdkgn5323285b4npq3z6_c0000gp/T/ipykernel_5511/2861124539.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  hier_df.groupby(level="cty", axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [45]:
print(df)

   key1  key2     data1     data2
0     a     1 -0.573655  0.008590
1     a     2  0.402903  0.286663
2  None     1 -0.794832 -0.319291
3     b     2  0.505938 -1.031302
4     b     1  0.677217 -0.054212
5     a  <NA> -0.520308 -1.120090
6  None     1 -1.613930 -1.532617

In [46]:
grouped = df.groupby("key1")

In [47]:
grouped["data1"].nsmallest(2)

key1
a     0   -0.573655
      5   -0.520308
b     3    0.505938
      4    0.677217
Name: data1, dtype: float64

In [48]:
def peak_to_peak(arr):
    return arr.max() - arr.min()
grouped.agg(peak_to_peak)

      key2     data1     data2
key1
a        1  0.976559  1.406753
b        1  0.171279  0.977090

In [49]:
grouped.describe()

      key2                                           data1            ...  \
     count mean       std  min   25%  50%   75%  max count      mean  ...
key1                                                                  ...
a      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   3.0 -0.230353  ...
b      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   2.0  0.591577  ...

                         data2                                         \
           75%       max count      mean       std       min      25%
key1
a    -0.058702  0.402903   3.0 -0.274946  0.745005 -1.120090 -0.55575
b     0.634397  0.677217   2.0 -0.542757  0.690907 -1.031302 -0.78703


           50%       75%       max
key1
a     0.008590  0.147627  0.286663
b    -0.542757 -0.298485 -0.054212

[2 rows x 24 columns]

In [50]:
tips = pd.read_csv("/Users/grojas/Documents/ProjectsPycharm/Projects/DataAnalisisBook/DATA/pandasexamples/examples/tips.csv")

In [51]:
tips.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

In [52]:
tips["tip_pct"] = tips["tip"] / tips["total_bill"]

In [53]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [54]:
grouped = tips.groupby(["day", "smoker"])

In [55]:
grouped_pct = grouped["tip_pct"]

In [56]:
grouped_pct.agg("mean")

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [57]:
grouped_pct.agg(["mean", "std", peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [58]:
grouped_pct.agg([("average", "mean"), ("stdev", np.std)])

/var/folders/7p/3wrdkgn5323285b4npq3z6_c0000gp/T/ipykernel_5511/3111280939.py:1: FutureWarning: The provided callable <function std at 0x10e27e9e0> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  grouped_pct.agg([("average", "mean"), ("stdev", np.std)])

              average     stdev
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [59]:
functions = ["count", "mean", "max"]

In [60]:
result = grouped[["tip_pct", "total_bill"]].agg(functions)

In [61]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [62]:
result["tip_pct"]

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [63]:
ftuples = [("Average", "mean"), ("Variance", np.var)]

In [64]:
grouped[["tip_pct", "total_bill"]].agg(ftuples)

/var/folders/7p/3wrdkgn5323285b4npq3z6_c0000gp/T/ipykernel_5511/780895.py:1: FutureWarning: The provided callable <function var at 0x10e27eb90> is currently using SeriesGroupBy.var. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "var" instead.
  grouped[["tip_pct", "total_bill"]].agg(ftuples)

              tip_pct           total_bill
              Average  Variance    Average    Variance
day  smoker
Fri  No      0.151650  0.000791  18.420000   25.596333
     Yes     0.174783  0.002631  16.813333   82.562438
Sat  No      0.158048  0.001581  19.661778   79.908965
     Yes     0.147906  0.003767  21.276667  101.387535
Sun  No      0.160113  0.001793  20.506667   66.099980
     Yes     0.187250  0.023757  24.120000  109.046044
Thur No      0.160298  0.001503  17.113111   59.625081
     Yes     0.163863  0.001551  19.190588   69.808518

In [65]:
grouped.agg({"tip": np.max, "size": "sum"})

/var/folders/7p/3wrdkgn5323285b4npq3z6_c0000gp/T/ipykernel_5511/727700194.py:1: FutureWarning: The provided callable <function amax at 0x10e27dc60> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  grouped.agg({"tip": np.max, "size": "sum"})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [66]:
grouped.agg({"tip":np.max, "size": "sum"})

/var/folders/7p/3wrdkgn5323285b4npq3z6_c0000gp/T/ipykernel_5511/2136087996.py:1: FutureWarning: The provided callable <function amax at 0x10e27dc60> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  grouped.agg({"tip":np.max, "size": "sum"})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [67]:
grouped.agg({"tip_pct": ["min", "max", "mean", "std"],
             "size": "sum"})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [68]:
tips.groupby(["day", "smoker"], as_index=False).mean(numeric_only=True)

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [69]:
# Apply
def top(df, n=5, column="tip_pct"):
    return df.sort_values(by=column)[:n]

In [70]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
237       32.83  1.17    Yes  Sat  Dinner     2  0.035638
102       44.30  2.50    Yes  Sat  Dinner     3  0.056433
57        26.41  1.50     No  Sat  Dinner     2  0.056797
0         16.99  1.01     No  Sun  Dinner     2  0.059447
187       30.46  2.00    Yes  Sun  Dinner     5  0.065660
210       30.06  2.00    Yes  Sat  Dinner     3  0.066534

In [71]:
tips.groupby("smoker").apply(top)

/var/folders/7p/3wrdkgn5323285b4npq3z6_c0000gp/T/ipykernel_5511/242339874.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips.groupby("smoker").apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     57        26.41  1.50     No   Sat  Dinner     2  0.056797
       0         16.99  1.01     No   Sun  Dinner     2  0.059447
       48        28.55  2.05     No   Sun  Dinner     3  0.071804
       146       18.64  1.36     No  Thur   Lunch     3  0.072961
       130       19.08  1.50     No  Thur   Lunch     2  0.078616
Yes    237       32.83  1.17    Yes   Sat  Dinner     2  0.035638
       102       44.30  2.50    Yes   Sat  Dinner     3  0.056433
       187       30.46  2.00    Yes   Sun  Dinner     5  0.065660
       210       30.06  2.00    Yes   Sat  Dinner     3  0.066534
       240       27.18  2.00    Yes   Sat  Dinner     2  0.073584

In [72]:
tips.groupby(["smoker", "day"]).apply(top, n=1, column="total_bill")

/var/folders/7p/3wrdkgn5323285b4npq3z6_c0000gp/T/ipykernel_5511/2722508240.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips.groupby(["smoker", "day"]).apply(top, n=1, column="total_bill")

                 total_bill   tip smoker   day    time  size   tip_pct
smoker day
No     Fri  99        12.46  1.50     No   Fri  Dinner     2  0.120385
       Sat  111        7.25  1.00     No   Sat  Dinner     1  0.137931
       Sun  6          8.77  2.00     No   Sun  Dinner     2  0.228050
       Thur 149        7.51  2.00     No  Thur   Lunch     2  0.266312
Yes    Fri  92         5.75  1.00    Yes   Fri  Dinner     2  0.173913
       Sat  67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       Sun  172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
       Thur 196       10.34  2.00    Yes  Thur   Lunch     2  0.193424

In [73]:
result = tips.groupby("smoker")["tip_pct"].describe()

In [74]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [75]:
result.unstack("smoker")

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [76]:
def f(group):
    return group.describe()

In [77]:
grouped.apply(f)

/var/folders/7p/3wrdkgn5323285b4npq3z6_c0000gp/T/ipykernel_5511/37897609.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  grouped.apply(f)

                   total_bill       tip  size   tip_pct
day  smoker
Fri  No     count    4.000000  4.000000  4.00  4.000000
            mean    18.420000  2.812500  2.25  0.151650
            std      5.059282  0.898494  0.50  0.028123
            min     12.460000  1.500000  2.00  0.120385
            25%     15.100000  2.625000  2.00  0.137239
...                       ...       ...   ...       ...
Thur Yes    min     10.340000  2.000000  2.00  0.090014
            25%     13.510000  2.000000  2.00  0.148038
            50%     16.470000  2.560000  2.00  0.153846
            75%     19.810000  4.000000  2.00  0.194837
            max     43.110000  5.000000  4.00  0.241255

[64 rows x 4 columns]

In [78]:
tips.groupby("smoker", group_keys=False).apply(top)

/var/folders/7p/3wrdkgn5323285b4npq3z6_c0000gp/T/ipykernel_5511/2350148657.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips.groupby("smoker", group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
57        26.41  1.50     No   Sat  Dinner     2  0.056797
0         16.99  1.01     No   Sun  Dinner     2  0.059447
48        28.55  2.05     No   Sun  Dinner     3  0.071804
146       18.64  1.36     No  Thur   Lunch     3  0.072961
130       19.08  1.50     No  Thur   Lunch     2  0.078616
237       32.83  1.17    Yes   Sat  Dinner     2  0.035638
102       44.30  2.50    Yes   Sat  Dinner     3  0.056433
187       30.46  2.00    Yes   Sun  Dinner     5  0.065660
210       30.06  2.00    Yes   Sat  Dinner     3  0.066534
240       27.18  2.00    Yes   Sat  Dinner     2  0.073584

In [79]:
frame = pd.DataFrame({"data1": np.random.standard_normal(1000),
                      "data2": np.random.standard_normal(1000)})

In [80]:
frame.head()

      data1     data2
0  0.202208  0.231847
1 -0.949802  0.688379
2 -0.469249 -2.392290
3 -1.876024 -0.960327
4 -0.039022 -0.874756

In [81]:
quartiles= pd.cut(frame.data1, 4)

In [82]:
quartiles.head()

0     (-0.443, 1.322]
1    (-2.207, -0.443]
2    (-2.207, -0.443]
3    (-2.207, -0.443]
4     (-0.443, 1.322]
Name: data1, dtype: category
Categories (4, interval[float64, right]): [(-3.979, -2.207] < (-2.207, -0.443] < (-0.443, 1.322] < (1.322, 3.087]]

In [83]:
def get_stats(group):
    return {"min": group.min(), "max": group.max(),
            "count": group.count(), "mean": group.mean()}

In [84]:
grouped = frame.groupby(quartiles)

/var/folders/7p/3wrdkgn5323285b4npq3z6_c0000gp/T/ipykernel_5511/4157715240.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  grouped = frame.groupby(quartiles)

In [85]:
grouped.apply(get_stats)

data1
(-3.979, -2.207]    {'min': [-3.972405262827947, -1.86466586680396...
(-2.207, -0.443]    {'min': [-2.184606887741164, -2.72960674011607...
(-0.443, 1.322]     {'min': [-0.44220241468767374, -3.239121202883...
(1.322, 3.087]      {'min': [1.3321128728442255, -1.81725477834313...
dtype: object

In [86]:
grouped.agg(["min", "max", "count", "mean"])

                     data1                               data2            \
                       min       max count      mean       min       max
data1
(-3.979, -2.207] -3.972405 -2.231182    14 -2.591284 -1.864666  1.700166
(-2.207, -0.443] -2.184607 -0.444501   322 -1.067942 -2.729607  2.764864
(-0.443, 1.322]  -0.442202  1.322035   574  0.341244 -3.239121  3.729868
(1.322, 3.087]    1.332113  3.087261    90  1.764561 -1.817255  2.643659


                 count      mean
data1
(-3.979, -2.207]    14 -0.645317
(-2.207, -0.443]   322 -0.020567
(-0.443, 1.322]    574  0.019248
(1.322, 3.087]      90 -0.085875

In [87]:
quartiles_samp= pd.qcut(frame["data1"], 10, labels=False)

In [88]:
quartiles_samp.head()

0    5
1    1
2    3
3    0
4    4
Name: data1, dtype: int64

In [89]:
grouped = frame.groupby(quartiles_samp)

In [90]:
grouped.apply(get_stats)

data1
0    {'min': [-3.972405262827947, -2.00730567084432...
1    {'min': [-1.3658931326395567, -2.1932959333617...
2    {'min': [-0.8921197166133683, -2.7296067401160...
3    {'min': [-0.5462380983487811, -3.2391212028838...
4    {'min': [-0.24431746897708295, -2.584856787882...
5    {'min': [-0.0187149450101606, -2.7361413294983...
6    {'min': [0.25711089306085905, -2.0400230331448...
7    {'min': [0.5118485409797586, -2.60344848259175...
8    {'min': [0.8195329950211229, -2.88027860468539...
9    {'min': [1.2524842753773662, -1.81725477834313...
dtype: object

In [91]:
s = pd.Series(np.random.standard_normal(6))

In [92]:
s[::2] = np.nan

In [93]:
s

0         NaN
1    1.086876
2         NaN
3    0.166519
4         NaN
5    0.406303
dtype: float64

In [94]:
s.fillna(s.mean())

0    0.553233
1    1.086876
2    0.553233
3    0.166519
4    0.553233
5    0.406303
dtype: float64

In [95]:
states = ["Ohio", "New York", "Vermont", "Florida",
          "Oregon", "Nevada", "California", "Idaho"]

In [96]:
group_key = ["East", "East", "East", "East","West", "West", "West", "West"]

In [97]:
data = pd.Series(np.random.standard_normal(8), index=states)

In [98]:
data

Ohio          0.462049
New York      0.542593
Vermont      -1.276442
Florida      -0.541669
Oregon       -1.162172
Nevada       -2.051763
California    0.593790
Idaho         0.063012
dtype: float64

In [99]:
data[["Vermont", "Nevada", "Idaho"]] = np.nan

In [100]:
data

Ohio          0.462049
New York      0.542593
Vermont            NaN
Florida      -0.541669
Oregon       -1.162172
Nevada             NaN
California    0.593790
Idaho              NaN
dtype: float64

In [101]:
data.groupby(group_key).size()

East    4
West    4
dtype: int64

In [102]:
data.groupby(group_key).count()

East    3
West    2
dtype: int64

In [103]:
data.groupby(group_key).mean()

East    0.154324
West   -0.284191
dtype: float64

In [104]:
def fill_mean(group):
    return group.fillna(group.mean())

In [105]:
data.groupby(group_key).apply(fill_mean)

East  Ohio          0.462049
      New York      0.542593
      Vermont       0.154324
      Florida      -0.541669
West  Oregon       -1.162172
      Nevada       -0.284191
      California    0.593790
      Idaho        -0.284191
dtype: float64

In [106]:
fill_values = {"East": 0.5, "West": -1}

In [107]:
def fill_func(group):
    return group.fillna(fill_values[group.name])

In [108]:
data.groupby(group_key).apply(fill_func)

East  Ohio          0.462049
      New York      0.542593
      Vermont       0.500000
      Florida      -0.541669
West  Oregon       -1.162172
      Nevada       -1.000000
      California    0.593790
      Idaho        -1.000000
dtype: float64

In [109]:
suits = ["H", "S", "C", "D"]
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ["A"] + list(range(2, 11)) + ["J", "K", "Q"]
cards = []
for suit in suits:
    cards.extend(str(num) + suit for num in base_names)
deck = pd.Series(card_val, index=cards)

In [110]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [111]:
def draw(deck, n=5):
    return deck.sample(n)

In [112]:
draw(deck)

8D      8
10H    10
8C      8
KH     10
QD     10
dtype: int64

In [113]:
def get_suit(card):
    # last letter is suit
    return card[-1]

In [114]:
deck.groupby(get_suit).apply(draw, n=2)

C  7C      7
   3C      3
D  4D      4
   9D      9
H  JH     10
   4H      4
S  10S    10
   4S      4
dtype: int64

In [115]:
deck.groupby(get_suit).apply(draw, n=2)

C  6C      6
   2C      2
D  9D      9
   AD      1
H  5H      5
   10H    10
S  6S      6
   2S      2
dtype: int64

In [116]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

7C      7
10C    10
3D      3
JD     10
6H      6
8H      8
8S      8
3S      3
dtype: int64

In [117]:
df = pd.DataFrame({"category": ["a", "a", "a", "a", "b", "b", "b", "b"],
                   "data": np.random.standard_normal(8),
                   "weights": np.random.standard_normal(8)})

In [118]:
df

  category      data   weights
0        a  0.504892  1.879322
1        a -0.519506 -1.761872
2        a  0.755831 -1.013729
3        a -0.117212  0.453052
4        b  0.066370 -0.473437
5        b  1.079587 -0.074604
6        b  1.953103 -0.862576
7        b  1.209234  0.128662

In [119]:
grouped = df.groupby("category")

In [120]:
def get_wavg(group):
    return np.average(group["data"], weights=group["weights"])

In [121]:
grouped.apply(get_wavg)

/var/folders/7p/3wrdkgn5323285b4npq3z6_c0000gp/T/ipykernel_5511/423584187.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  grouped.apply(get_wavg)

category
a   -2.357360
b    1.280139
dtype: float64

In [122]:
close_px = pd.read_csv("/Users/grojas/Documents/ProjectsPycharm/Projects/DataAnalisisBook/DATA/pandasexamples/examples/stock_px.csv", parse_dates=True, index_col=0)

In [123]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AAPL    2214 non-null   float64
 1   MSFT    2214 non-null   float64
 2   XOM     2214 non-null   float64
 3   SPX     2214 non-null   float64
dtypes: float64(4)
memory usage: 86.5 KB

In [124]:
close_px.tail()

              AAPL   MSFT    XOM      SPX
2011-10-10  388.81  26.94  76.28  1194.89
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [125]:
def spx_corr(group):
    return group.corrwith(group["SPX"])

In [126]:
rets= close_px.pct_change().dropna()

In [127]:
def get_year(x):
    return x.year

In [128]:
by_year = rets.groupby(get_year)

In [129]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [130]:
def corr_aapl_msft(x):
    return x["AAPL"].corr(x["MSFT"])

In [131]:
by_year.apply(corr_aapl_msft)

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

In [132]:
import statsmodels.api as sm
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X["intercept"] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params

In [133]:
by_year.apply(regress, yvar="AAPL", xvars=["SPX"])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

In [134]:
# 10.4 Group Transforms and “Unwrapped” GroupBys
import statsmodels.api as sm
def regress(data, yvar=None, xvars=None):
    Y = data[yvar]
    X = data[xvars]
    X["intercept"] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params

In [135]:
by_year.apply(regress, yvar="AAPL", xvars=["SPX"])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

In [136]:
df = pd.DataFrame({'key':['a','b','c']*4,'value': np.arange(12.)})

In [137]:
df

   key  value
0    a    0.0
1    b    1.0
2    c    2.0
3    a    3.0
4    b    4.0
5    c    5.0
6    a    6.0
7    b    7.0
8    c    8.0
9    a    9.0
10   b   10.0
11   c   11.0

In [138]:
g = df.groupby('key')

In [139]:
g.mean()

     value
key
a      4.5
b      5.5
c      6.5

In [140]:
def get_mean(group):
    return group.mean()

In [141]:
g.transform(get_mean)

    value
0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5

In [142]:
g.transform('mean')

    value
0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5

In [143]:
def times_two(group):
    return group*2

In [144]:
g.transform(times_two)

    value
0     0.0
1     2.0
2     4.0
3     6.0
4     8.0
5    10.0
6    12.0
7    14.0
8    16.0
9    18.0
10   20.0
11   22.0

In [145]:
def get_ranks(group):
    return group.rank(ascending=False)

In [146]:
g.transform(get_ranks)

    value
0     4.0
1     4.0
2     4.0
3     3.0
4     3.0
5     3.0
6     2.0
7     2.0
8     2.0
9     1.0
10    1.0
11    1.0

In [147]:
def normalize(x):
    return ( x - x.mean())/x.std()

In [148]:
g.transform(normalize)

       value
0  -1.161895
1  -1.161895
2  -1.161895
3  -0.387298
4  -0.387298
5  -0.387298
6   0.387298
7   0.387298
8   0.387298
9   1.161895
10  1.161895
11  1.161895

In [149]:
g.apply(normalize)

           value
key
a   0  -1.161895
    3  -0.387298
    6   0.387298
    9   1.161895
b   1  -1.161895
    4  -0.387298
    7   0.387298
    10  1.161895
c   2  -1.161895
    5  -0.387298
    8   0.387298
    11  1.161895

In [150]:
g.transform('mean')

    value
0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5

In [153]:
normalized = (df['value'] - g.transform('mean')) / g.transform('std')
normalized

     0   1   2   3   4   5   6   7   8   9  10  11  value
0  NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN    NaN
1  NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN    NaN
2  NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN    NaN
3  NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN    NaN
4  NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN    NaN
5  NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN    NaN
6  NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN    NaN
7  NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN    NaN
8  NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN    NaN
9  NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN    NaN
10 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN    NaN
11 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN    NaN